artillery.yml
config:
  target: "http://localhost:3000"
  phases:
    # 가상 유저 100명이 메인 페이지 목록 API를 동시에 요청하는 상황을 시뮬레이션
    - duration: 30
      arrivalCount: 100
      name: "메인 페이지 100명 동시 접속"
  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  - name: "메인 페이지 웹툰 목록 조회"
    flow:
      - get:
          url: "/webtoon/list?page=1&limit=21&sort=인기순"
          expect:
            - statusCode: 200
      - get:
          url: "/webtoon/list?page=1&limit=21&day=latest"
          expect:
            - statusCode: 200